# IsMtrlFillStyleByCls

```pascal
FUNCTION IsMtrlFillStyleByCls(materialHandle : HANDLE): BOOLEAN;
```

```python
def vs.IsMtrlFillStyleByCls(materialHandle):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|materialHandle:|HANDLE|   |

## Version
Availability: from Vectorworks 2021

## Category
* Object Attributes